VoodooChild99/qemu-stm32f769/hw/net/stm32f7-eth.c
/*
 * STM32F7XX ETH
 * 
 * Copyright (C) 2022 JSSEC
 * 
 * Authors:
 * 	Rayhub <leicq@seu.edu.cn>
 * 
 * This program is free software; you can redistribute it and/or modify
 * it under the terms of the GNU General Public License as published by
 * the Free Software Foundation; either version 2 of the License, or
 * (at your option) any later version.
 * 
 * This program is distributed in the hope that it will be useful,
 * but WITHOUT ANY WARRANTY; without even the implied warranty of
 * MERCHANTABILITY or FITNESS FOR A PARTICULAR PURPOSE.  See the
 * GNU General Public License for more details.
 * 
 * You should have received a copy of the GNU General Public License along
 * with this program; if not, see <http://www.gnu.org/licenses/>.
 */

#include "qemu/osdep.h"
#include "qemu/log.h"
#include "qemu/bitops.h"
#include "hw/sysbus.h"
#include "hw/irq.h"
#include "migration/vmstate.h"
#include "hw/registerfields.h"
#include "hw/resettable.h"
#include "hw/net/stm32f7-eth.h"
#include "hw/qdev-properties.h"
#include "exec/cpu-common.h"
#include "sysemu/dma.h"

#define STM32F7_ETH_SIZE				0x1400

REG32(MACCR, 0x0)
	FIELD(MACCR, RE, 2, 1)
	FIELD(MACCR, TE, 3, 1)
	FIELD(MACCR, DC, 4, 1)
	FIELD(MACCR, BL, 5, 2)
	FIELD(MACCR, APCS, 7, 1)
	FIELD(MACCR, RD, 9, 1)
	FIELD(MACCR, IPCO, 10, 1)
	FIELD(MACCR, DM, 11, 1)
	FIELD(MACCR, LM, 12, 1)
	FIELD(MACCR, ROD, 13, 1)
	FIELD(MACCR, FES, 14, 1)
	FIELD(MACCR, CSD, 16, 1)
	FIELD(MACCR, IFG, 17, 3)
	FIELD(MACCR, JD, 22, 1)
	FIELD(MACCR, WD, 23, 1)
	FIELD(MACCR, CSTF, 25, 1)
REG32(MACFFR, 0x4)
	FIELD(MACFFR, PM, 0, 1)
	FIELD(MACFFR, HU, 1, 1)
	FIELD(MACFFR, HM, 2, 1)
	FIELD(MACFFR, DAIF, 3, 1)
	FIELD(MACFFR, RAM, 4, 1)
	FIELD(MACFFR, BFD, 5, 1)
	FIELD(MACFFR, PCF, 6, 1)
	FIELD(MACFFR, SAIF, 7, 1)
	FIELD(MACFFR, SAF, 8, 1)
	FIELD(MACFFR, HPF, 9, 1)
	FIELD(MACFFR, RA, 31, 1)
REG32(MACHTHR, 0x8)
	FIELD(MACHTHR, HTH, 0, 32)
REG32(MACHTLR, 0xc)
	FIELD(MACHTLR, HTL, 0, 32)
REG32(MACMIIAR, 0x10)
	FIELD(MACMIIAR, MB, 0, 1)
	FIELD(MACMIIAR, MW, 1, 1)
	FIELD(MACMIIAR, CR, 2, 3)
	FIELD(MACMIIAR, MR, 6, 5)
	FIELD(MACMIIAR, PA, 11, 5)
REG32(MACMIIDR, 0x14)
	FIELD(MACMIIDR, TD, 0, 16)
REG32(MACFCR, 0x18)
	FIELD(MACFCR, FCB, 0, 1)
	FIELD(MACFCR, TFCE, 1, 1)
	FIELD(MACFCR, RFCE, 2, 1)
	FIELD(MACFCR, UPFD, 3, 1)
	FIELD(MACFCR, PLT, 4, 2)
	FIELD(MACFCR, ZQPD, 7, 1)
	FIELD(MACFCR, PT, 16, 16)
REG32(MACVLANTR, 0x1c)
	FIELD(MACVLANTR, VLANTI, 0, 16)
	FIELD(MACVLANTR, VLANTC, 16, 1)
REG32(MACPMTCSR, 0x2c)
	FIELD(MACPMTCSR, PD, 0, 1)
	FIELD(MACPMTCSR, MPE, 1, 1)
	FIELD(MACPMTCSR, WFE, 2, 1)
	FIELD(MACPMTCSR, MPR, 5, 1)
	FIELD(MACPMTCSR, WFR, 6, 1)
	FIELD(MACPMTCSR, GU, 9, 1)
	FIELD(MACPMTCSR, WFFRPR, 31, 1)
REG32(MACDBGR, 0x34)
	FIELD(MACDBGR, CR, 0, 1)
	FIELD(MACDBGR, CSR, 1, 1)
	FIELD(MACDBGR, ROR, 2, 1)
	FIELD(MACDBGR, MCF, 3, 1)
	FIELD(MACDBGR, MCP, 4, 1)
	FIELD(MACDBGR, MCFHP, 5, 1)
REG32(MACSR, 0x38)
	FIELD(MACSR, PMTS, 3, 1)
	FIELD(MACSR, MMCS, 4, 1)
	FIELD(MACSR, MMCRS, 5, 1)
	FIELD(MACSR, MMCTS, 6, 1)
	FIELD(MACSR, TSTS, 9, 1)
REG32(MACIMR, 0x3c)
	FIELD(MACIMR, PMTIM, 3, 1)
	FIELD(MACIMR, TSTIM, 9, 1)
REG32(MACA0HR, 0x40)
	FIELD(MACA0HR, MACA0H, 0, 16)
	FIELD(MACA0HR, MO, 31, 1)
REG32(MACA0LR, 0x44)
	FIELD(MACA0LR, MACA0L, 0, 32)
REG32(MACA1HR, 0x48)
	FIELD(MACA1HR, MACA1H, 0, 16)
	FIELD(MACA1HR, MBC, 24, 6)
	FIELD(MACA1HR, SA, 30, 1)
	FIELD(MACA1HR, AE, 31, 1)
REG32(MACA1LR, 0x4c)
	FIELD(MACA1LR, MACA1LR, 0, 32)
REG32(MACA2HR, 0x50)
	FIELD(MACA2HR, MAC2AH, 0, 16)
	FIELD(MACA2HR, MBC, 24, 6)
	FIELD(MACA2HR, SA, 30, 1)
	FIELD(MACA2HR, AE, 31, 1)
REG32(MACA2LR, 0x54)
	FIELD(MACA2LR, MACA2L, 0, 31)
REG32(MACA3HR, 0x58)
	FIELD(MACA3HR, MACA3H, 0, 16)
	FIELD(MACA3HR, MBC, 24, 6)
	FIELD(MACA3HR, SA, 30, 1)
	FIELD(MACA3HR, AE, 31, 1)
REG32(MACA3LR, 0x5c)
	FIELD(MACA3LR, MBCA3L, 0, 32)
REG32(MACRWUFFER, 0x60)
REG32(MMCCR, 0x100)
	FIELD(MMCCR, CR, 0, 1)
	FIELD(MMCCR, CSR, 1, 1)
	FIELD(MMCCR, ROR, 2, 1)
	FIELD(MMCCR, MCF, 3, 1)
	FIELD(MMCCR, MCP, 4, 1)
	FIELD(MMCCR, MCFHP, 5, 1)
REG32(MMCRIR, 0x104)
	FIELD(MMCRIR, RFCES, 5, 1)
	FIELD(MMCRIR, RFAES, 6, 1)
	FIELD(MMCRIR, RGUFS, 17, 1)
REG32(MMCTIR, 0x108)
	FIELD(MMCTIR, TGFSCS, 14, 1)
	FIELD(MMCTIR, TGFMSCS, 15, 1)
	FIELD(MMCTIR, TGFS, 21, 1)
REG32(MMCRIMR, 0x10c)
	FIELD(MMCRIMR, RFCEM, 5, 1)
	FIELD(MMCRIMR, RFAEM, 6, 1)
	FIELD(MMCRIMR, RGUFM, 17, 1)
REG32(MMCTIMR, 0x110)
	FIELD(MMCTIMR, TGFSCM, 14, 1)
	FIELD(MMCTIMR, TGFMSCM, 15, 1)
	FIELD(MMCTIMR, TGFM, 16, 1)
REG32(MMCTGFSCCR, 0x14c)
	FIELD(MMCTGFSCCR, TGFSCC, 0, 32)
REG32(MMCTGFMSCCR, 0x150)
	FIELD(MMCTGFMSCCR, TGFMSCC, 0, 32)
REG32(MMCTGFCR, 0x168)
	FIELD(MMCTGFCR, TGFC, 0, 32)
REG32(MMCRFCECR, 0x194)
	FIELD(MMCRFCECR, RFCFC, 0, 32)
REG32(MMCRFAECR, 0x198)
	FIELD(MMCRFAECR, RFAEC, 0, 32)
REG32(MMCRGUFCR, 0x1c4)
	FIELD(MMCRGUFCR, RGUFC, 0, 32)
REG32(PTPTSCR, 0x700)
	FIELD(PTPTSCR, TSE, 0, 1)
	FIELD(PTPTSCR, TSFCU, 1, 1)
	FIELD(PTPTSCR, TSPTPPSV2E, 10, 1)
	FIELD(PTPTSCR, TSSPTPOEFE, 11, 1)
	FIELD(PTPTSCR, TSSIPV6FE, 12, 1)
	FIELD(PTPTSCR, TSSIPV4FE, 13, 1)
	FIELD(PTPTSCR, TSSEME, 14, 1)
	FIELD(PTPTSCR, TSSMRME, 15, 1)
	FIELD(PTPTSCR, TSCNT, 16, 2)
	FIELD(PTPTSCR, TSPFFMAE, 18, 1)
	FIELD(PTPTSCR, TSSTI, 2, 1)
	FIELD(PTPTSCR, TSSTU, 3, 1)
	FIELD(PTPTSCR, TSITE, 4, 1)
	FIELD(PTPTSCR, TTSARU, 5, 1)
	FIELD(PTPTSCR, TSSARFE, 8, 1)
	FIELD(PTPTSCR, TSSSR, 9, 1)
REG32(PTPSSIR, 0x704)
	FIELD(PTPSSIR, STSSI, 0, 8)
REG32(PTPTSHR, 0x708)
	FIELD(PTPTSHR, STS, 0, 32)
REG32(PTPTSLR, 0x70c)
	FIELD(PTPTSLR, STSS, 0, 31)
	FIELD(PTPTSLR, STPNS, 31, 1)
REG32(PTPTSHUR, 0x710)
	FIELD(PTPTSHUR, TSUS, 0, 32)
REG32(PTPTSLUR, 0x714)
	FIELD(PTPTSLUR, TSUSS, 0, 31)
	FIELD(PTPTSLUR, TSUPNS, 31, 1)
REG32(PTPTSAR, 0x718)
	FIELD(PTPTSAR, TSA, 0, 32)
REG32(PTPTTHR, 0x71c)
	FIELD(PTPTTHR, TTSH, 0, 32)
REG32(PTPTTLR, 0x720)
	FIELD(PTPTTLR, TTSL, 0, 32)
REG32(PTPTSSR, 0x728)
	FIELD(PTPTSSR, TSSO, 0, 1)
	FIELD(PTPTSSR, TSTTR, 1, 1)
REG32(PTPPPSCR, 0x72c)
	FIELD(PTPPPSCR, TSSO, 0, 1)
	FIELD(PTPPPSCR, TSTTR, 1, 1)
REG32(DMABMR, 0x1000)
	FIELD(DMABMR, SR, 0, 1)
	FIELD(DMABMR, DA, 1, 1)
	FIELD(DMABMR, DSL, 2, 5)
	FIELD(DMABMR, EDFE, 7, 1)
	FIELD(DMABMR, PBL, 8, 6)
	FIELD(DMABMR, RTPR, 14, 2)
	FIELD(DMABMR, FB, 16, 1)
	FIELD(DMABMR, RDP, 17, 6)
	FIELD(DMABMR, USP, 23, 1)
	FIELD(DMABMR, FPM, 24, 1)
	FIELD(DMABMR, AAB, 25, 1)
	FIELD(DMABMR, MB, 26, 1)
REG32(DMATPDR, 0x1004)
	FIELD(DMATPDR, TPD, 0, 32)
REG32(DMARPDR, 0x1008)
	FIELD(DMARPDR, RPD, 0, 32)
REG32(DMARDLAR, 0x100c)
	FIELD(DMARDLAR, SRL, 0, 32)
REG32(DMATDLAR, 0x1010)
	FIELD(DMATDLAR, STL, 0, 32)
REG32(DMASR, 0x1014)
	FIELD(DMASR, TS, 0, 1)
	FIELD(DMASR, TPSS, 1, 1)
	FIELD(DMASR, TBUS, 2, 1)
	FIELD(DMASR, TJTS, 3, 1)
	FIELD(DMASR, ROS, 4, 1)
	FIELD(DMASR, TUS, 5, 1)
	FIELD(DMASR, RS, 6, 1)
	FIELD(DMASR, RBUS, 7, 1)
	FIELD(DMASR, RPSS, 8, 1)
	FIELD(DMASR, PWTS, 9, 1)
	FIELD(DMASR, ETS, 10, 1)
	FIELD(DMASR, FBES, 13, 1)
	FIELD(DMASR, ERS, 14, 1)
	FIELD(DMASR, AIS, 15, 1)
	FIELD(DMASR, NIS, 16, 1)
	FIELD(DMASR, RPS, 17, 3)
	FIELD(DMASR, TPS, 20, 3)
	FIELD(DMASR, EBS, 23, 3)
	FIELD(DMASR, MMCS, 27, 1)
	FIELD(DMASR, PMTS, 28, 1)
	FIELD(DMASR, TSTS, 29, 1)
REG32(DMAOMR, 0x1018)
	FIELD(DMAOMR, SR, 1, 1)
	FIELD(DMAOMR, OSF, 2, 1)
	FIELD(DMAOMR, RTC, 3, 2)
	FIELD(DMAOMR, FUGF, 6, 1)
	FIELD(DMAOMR, FEF, 7, 1)
	FIELD(DMAOMR, ST, 13, 1)
	FIELD(DMAOMR, TTC, 14, 3)
	FIELD(DMAOMR, FTF, 20, 1)
	FIELD(DMAOMR, TSF, 21, 1)
	FIELD(DMAOMR, DFRF, 24, 1)
	FIELD(DMAOMR, RSF, 25, 1)
	FIELD(DMAOMR, DTCEFD, 26, 1)
REG32(DMAIER, 0x101c)
	FIELD(DMAIER, TIE, 0, 1)
	FIELD(DMAIER, TPSIE, 1, 1)
	FIELD(DMAIER, TBUIE, 2, 1)
	FIELD(DMAIER, TJTIE, 3, 1)
	FIELD(DMAIER, ROIE, 4, 1)
	FIELD(DMAIER, TUIE, 5, 1)
	FIELD(DMAIER, RIE, 6, 1)
	FIELD(DMAIER, RBUIE, 7, 1)
	FIELD(DMAIER, RPSIE, 8, 1)
	FIELD(DMAIER, RWTIE, 9, 1)
	FIELD(DMAIER, ETIE, 10, 1)
	FIELD(DMAIER, FBEIE, 13, 1)
	FIELD(DMAIER, ERIE, 14, 1)
	FIELD(DMAIER, AISE, 15, 1)
	FIELD(DMAIER, NISE, 16, 1)
REG32(DMAMFBOCR, 0x1020)
	FIELD(DMAMFBOCR, MFC, 0, 16)
	FIELD(DMAMFBOCR, OMFC, 16, 1)
	FIELD(DMAMFBOCR, MFA, 17, 11)
	FIELD(DMAMFBOCR, OFOC, 28, 1)
REG32(DMARSWTR, 0x1024)
	FIELD(DMARSWTR, RSWTC, 0, 8)
REG32(DMACHTDR, 0x1048)
	FIELD(DMACHTDR, HTDAP, 0, 32)
REG32(DMACHRDR, 0x104c)
	FIELD(DMACHRDR, HRDAP, 0, 32)
REG32(DMACHTBAR, 0x1050)
	FIELD(DMACHTBAR, HTBAP, 0, 32)
REG32(DMACHRBAR, 0x1054)
	FIELD(DMACHRBAR, HRBAP, 0, 32)

static void stm32f7_eth_register_reset(STM32F7ETH *t) {
	t->MACCR = 0x00008000;
	t->MACFFR = 0x00000000;
	t->MACHTHR = 0x00000000;
	t->MACHTLR = 0x00000000;
	t->MACMIIAR = 0x00000000;
	t->MACMIIDR = 0x00000026;
	t->MACFCR = 0x00000000;
	t->MACVLANTR = 0x00000000;
	t->MACPMTCSR = 0x00000000;
	t->MACDBGR = 0x00000000;
	t->MACSR = 0x00000000;
	t->MACIMR = 0x00000000;
	t->MACA0HR = 0x0010ffff;
	t->MACA0LR = 0xffffffff;
	t->MACA1HR = 0x0000ffff;
	t->MACA1LR = 0xffffffff;
	t->MACA2HR = 0x0000ffff;
	t->MACA2LR = 0xffffffff;
	t->MACA3HR = 0x0000ffff;
	t->MACA3LR = 0xffffffff;
	t->MACRWUFFER = 0xffffffff;
	t->MMCCR = 0x00000000;
	t->MMCRIR = 0x00000000;
	t->MMCTIR = 0x00000000;
	t->MMCRIMR = 0x00000000;
	t->MMCTIMR = 0x00000000;
	t->MMCTGFSCCR = 0x00000000;
	t->MMCTGFMSCCR = 0x00000000;
	t->MMCTGFCR = 0x00000000;
	t->MMCRFCECR = 0x00000000;
	t->MMCRFAECR = 0x00000000;
	t->MMCRGUFCR = 0x00000000;
	t->PTPTSCR = 0x00002000;
	t->PTPSSIR = 0x00000000;
	t->PTPTSHR = 0x00000000;
	t->PTPTSLR = 0x00000000;
	t->PTPTSHUR = 0x00000000;
	t->PTPTSLUR = 0x00000000;
	t->PTPTSAR = 0x00000000;
	t->PTPTTHR = 0x00000000;
	t->PTPTTLR = 0x00000000;
	t->PTPTSSR = 0x00000000;
	t->PTPPPSCR = 0x00000000;
	t->DMABMR = 0x00002101;
	t->DMATPDR = 0x00000000;
	t->DMARPDR = 0x00000000;
	t->DMARDLAR = 0x00000000;
	t->DMATDLAR = 0x00000000;
	t->DMASR = 0x00000000;
	t->DMAOMR = 0x00000000;
	t->DMAIER = 0x00000000;
	t->DMAMFBOCR = 0x00000000;
	t->DMARSWTR = 0x00000000;
	t->DMACHTDR = 0x00000000;
	t->DMACHRDR = 0x00000000;
	t->DMACHTBAR = 0x00000000;
	t->DMACHRBAR = 0x00000000;
	t->rxstate = 0;
	t->txstate = 0;
}

