VoodooChild99/qemu-stm32f769/hw/net/stm32f7-eth.c
typedef struct {
	uint32_t   Status;           /*!< Status */
	uint32_t   ControlBufferSize;     /*!< Control and Buffer1, Buffer2 lengths */
	uint32_t   Buffer1Addr;           /*!< Buffer1 address pointer */
	uint32_t   Buffer2NextDescAddr;   /*!< Buffer2 or next descriptor address pointer */
	/*!< Enhanced Ethernet DMA PTP Descriptors */
	uint32_t   ExtendedStatus;        /*!< Extended status for PTP receive descriptor */
	uint32_t   Reserved1;             /*!< Reserved */
	uint32_t   TimeStampLow;          /*!< Time Stamp Low value for transmit and receive */
	uint32_t   TimeStampHigh;         /*!< Time Stamp High value for transmit and receive */
} ETH_DMADescTypeDef;

static void stm32f7_eth_update(STM32F7ETH *t) {
	uint32_t sr = t->DMASR;
	uint32_t ier = t->DMAIER;
	uint32_t irq_flag = 0;

	if (((sr & R_DMASR_TS_MASK)		&& (ier & R_DMAIER_TIE_MASK))	||
		((sr & R_DMASR_TBUS_MASK)	&& (ier & R_DMAIER_TBUIE_MASK))	|| 
		((sr & R_DMASR_RS_MASK)		&& (ier & R_DMAIER_RIE_MASK))	|| 
		((sr & R_DMASR_ERS_MASK)	&& (ier & R_DMAIER_ERIE_MASK))) {
		t->DMASR |= R_DMASR_NIS_MASK;
		if (ier & R_DMAIER_NISE_MASK) {
			irq_flag = 1;
		}
	}

	if (((sr & R_DMASR_TPSS_MASK)	&& (ier & R_DMAIER_TPSIE_MASK))	||
		((sr & R_DMASR_TJTS_MASK)	&& (ier & R_DMAIER_TJTIE_MASK))	||
		((sr & R_DMASR_ROS_MASK)	&& (ier & R_DMAIER_ROIE_MASK))	||
		((sr & R_DMASR_TUS_MASK)	&& (ier & R_DMAIER_TUIE_MASK))	||
		((sr & R_DMASR_RBUS_MASK)	&& (ier & R_DMAIER_RBUIE_MASK))	||
		((sr & R_DMASR_RPSS_MASK)	&& (ier & R_DMAIER_RPSIE_MASK))	||
		((sr & R_DMASR_ETS_MASK)	&& (ier & R_DMAIER_ETIE_MASK))	||
		((sr & R_DMASR_FBES_MASK)	&& (ier & R_DMAIER_FBEIE_MASK))) {
		t->DMASR |= R_DMASR_AIS_MASK;
		if (ier & R_DMAIER_AISE_MASK) {
			irq_flag = 1;
		}
	}

	qemu_set_irq(t->irq[0], irq_flag);
}

static bool stm32f7_eth_can_receive(NetClientState* nc) {
   return true;
}

static ssize_t stm32f7_eth_receive(NetClientState *nc, const uint8_t *buf, size_t size) {
	STM32F7ETH *t = qemu_get_nic_opaque(nc);
	ETH_DMADescTypeDef rx_desc;
	uint32_t len_to_receive = size;
	uint32_t buffer_len;
	uint32_t next_status;
	uint32_t init_rx_desc_addr = t->cur_rx_descriptor;

	if (t->rxstate != 1) {
		return -1;
	}
	// uint32_t overflow_flag = 0;

	do {
		cpu_physical_memory_read(t->cur_rx_descriptor, &rx_desc, sizeof(ETH_DMADescTypeDef));
		buffer_len = rx_desc.ControlBufferSize & 0x00001fff;
		if (buffer_len < len_to_receive) {
			cpu_physical_memory_write(rx_desc.Buffer1Addr, buf, buffer_len);
			// receive unfinished
			len_to_receive -= buffer_len;
			cpu_physical_memory_read(rx_desc.Buffer2NextDescAddr, &next_status, sizeof(next_status));
			if (next_status & 0x80000000) {
				// own next
				// unset own
				rx_desc.Status &= (~(0x80000000));
				// unset last
				rx_desc.Status &= (~(0x00000100));
				if (len_to_receive + buffer_len == size) {
					// if first, set first
					rx_desc.Status |= 0x00000200;
				} else {
					// else, unset first
					rx_desc.Status &= (~(0x00000200));
				}
				cpu_physical_memory_write(t->cur_rx_descriptor, &(rx_desc.Status), sizeof(rx_desc.Status));
				if (rx_desc.Buffer2NextDescAddr == init_rx_desc_addr) {
					// seems that there are no more spaces, overflow!
					// overflow_flag = 1;
					printf("should not happen");
				}
				t->cur_rx_descriptor = rx_desc.Buffer2NextDescAddr;
				continue;
			} else {
				// dont own next
				rx_desc.Status |= 0x00004000;
				rx_desc.Status &= (~(0x80000000));
				// unset last
				rx_desc.Status &= (~(0x00000100));
				cpu_physical_memory_write(t->cur_rx_descriptor, &(rx_desc.Status), sizeof(rx_desc.Status));
				t->DMASR |= R_DMASR_RBUS_MASK;
				stm32f7_eth_update(t);
				return -1;
			}
		} else {
			cpu_physical_memory_write(rx_desc.Buffer1Addr, buf, len_to_receive);
			// receive finished
			// write timestamp
			// update status
			// set size
			rx_desc.Status &= (~(0x3fff));
			rx_desc.Status |= (((size + 4) & 0x3fff) << 16);
			// unset error
			rx_desc.Status &= (~(0x00004000));
			// unset own
			rx_desc.Status &= (~(0x80000000));
			// set last
			rx_desc.Status |= 0x00000100;
			if (len_to_receive == size) {
				// set first too
				rx_desc.Status |= 0x00000200;
			} else {
				// unset first
				rx_desc.Status &= (~(0x00000200));
			}
			len_to_receive = 0;
			cpu_physical_memory_write(t->cur_rx_descriptor, &(rx_desc.Status), sizeof(rx_desc.Status));
			t->cur_rx_descriptor = rx_desc.Buffer2NextDescAddr;
			t->DMASR |= R_DMASR_RS_MASK;
			stm32f7_eth_update(t);
			break;
		}
	} while(true);
	return size;
}

static void stm32f7_eth_timer_callback(void *opaque);

static void stm32f7_eth_send(STM32F7ETH *t) {
	uint32_t init_tx_desc_addr = t->cur_tx_descriptor;
	ETH_DMADescTypeDef tx_desc;
	int frame_len = 0;
	uint32_t start_tx_desc_addr = 0;
	uint32_t end_tx_desc_addr = 0;
	uint8_t *buf;
	uint8_t *trans_buf;

	if (t->timer) {
		timer_free(t->timer);
		t->timer = NULL;
	}

	if (t->txstate) {
		do {
			cpu_physical_memory_read(t->cur_tx_descriptor, &tx_desc, sizeof(tx_desc));
			if (tx_desc.Status & 0x80000000) {
				if ((tx_desc.Status & 0x30000000) == 0x30000000) {
					// last and first
					frame_len += tx_desc.ControlBufferSize & 0x1fff;
					end_tx_desc_addr = t->cur_tx_descriptor;
					start_tx_desc_addr = t->cur_tx_descriptor;
					break;
				} else if ((tx_desc.Status & 0x30000000) == 0x20000000) {
					// last
					frame_len += tx_desc.ControlBufferSize & 0x1fff;
					end_tx_desc_addr = t->cur_tx_descriptor;
					break;
				} else if ((tx_desc.Status & 0x30000000) == 0x10000000) {
					// first
					frame_len += tx_desc.ControlBufferSize & 0x1fff;
					start_tx_desc_addr = t->cur_tx_descriptor;
				} else {
					// inter
					frame_len += tx_desc.ControlBufferSize & 0x1fff;
				}
			}
			t->cur_tx_descriptor = tx_desc.Buffer2NextDescAddr;
		} while (tx_desc.Buffer2NextDescAddr != init_tx_desc_addr);

		if (start_tx_desc_addr && end_tx_desc_addr && frame_len) {
			assert(frame_len > 14);
			buf = g_malloc(frame_len);
			trans_buf = buf;
			init_tx_desc_addr = start_tx_desc_addr;
			t->cur_tx_descriptor = start_tx_desc_addr;
			do {
				cpu_physical_memory_read(t->cur_tx_descriptor, &tx_desc, sizeof(tx_desc));
				if (tx_desc.Status & 0x80000000) {
					// transfer it
					cpu_physical_memory_read(tx_desc.Buffer1Addr, trans_buf, (tx_desc.ControlBufferSize & 0x1ffff));
					frame_len -= (tx_desc.ControlBufferSize & 0x1ffff);
					if (frame_len <=0) {
						// done!
						trans_buf += (tx_desc.ControlBufferSize & 0x1ffff);
						assert(tx_desc.Status & 0x20000000);
						break;
					} else {
						trans_buf += (tx_desc.ControlBufferSize & 0x1ffff);
					}
					tx_desc.Status &= (~(0x80000000));
					cpu_physical_memory_write(t->cur_tx_descriptor, &(tx_desc.Status), sizeof(tx_desc.Status));
					t->cur_tx_descriptor = tx_desc.Buffer2NextDescAddr;
				} else {
					// dont own
					t->DMASR |= R_DMASR_TBUS_MASK;
					t->txstate = 0;
					stm32f7_eth_update(t);
					free(buf);
					return;
				}
			} while (tx_desc.Buffer2NextDescAddr != init_tx_desc_addr);
			assert(frame_len <= 0);
			frame_len = trans_buf - buf;
			qemu_send_packet(qemu_get_queue(t->nic), buf, frame_len);
			free(buf);
			tx_desc.Status &= (~(0x80000000));
			cpu_physical_memory_write(t->cur_tx_descriptor, &(tx_desc.Status), sizeof(tx_desc.Status));
			if (tx_desc.Status & 0x40000000) {
				// interrupt
				t->DMASR |= R_DMASR_TS_MASK;
				stm32f7_eth_update(t);
			}
			t->cur_tx_descriptor = tx_desc.Buffer2NextDescAddr;
		}
	}

	if (!(t->timer)) {
		t->timer = timer_new_ns(QEMU_CLOCK_VIRTUAL, stm32f7_eth_timer_callback, t);
	}
	timer_mod(t->timer, qemu_clock_get_ns(QEMU_CLOCK_VIRTUAL) + 10);
}

static uint64_t stm32f7_eth_read(void *opaque, hwaddr offset, unsigned size) {
	STM32F7ETH *t = STM32F7_ETH(opaque);
	uint64_t ret;

	switch (offset) {
		case A_MACCR:
			ret = t->MACCR;
			break;
		case A_MACFFR:
			ret = t->MACFFR;
			break;
		case A_MACHTHR:
			ret = t->MACHTHR;
			break;
		case A_MACHTLR:
			ret = t->MACHTLR;
			break;
		case A_MACMIIAR:
			ret = t->MACMIIAR;
			break;
		case A_MACMIIDR:
			ret = t->MACMIIDR;
			break;
		case A_MACFCR:
			ret = t->MACFCR;
			break;
		case A_MACVLANTR:
			ret = t->MACVLANTR;
			break;
		case A_MACPMTCSR:
			ret = t->MACPMTCSR;
			break;
		case A_MACDBGR:
			ret = t->MACDBGR;
			break;
		case A_MACSR:
			ret = t->MACSR;
			break;
		case A_MACIMR:
			ret = t->MACIMR;
			break;
		case A_MACA0HR:
			ret = ((t->conf.macaddr.a[5] << 8) | t->conf.macaddr.a[4]);
			break;
		case A_MACA0LR:
			ret = (t->conf.macaddr.a[3] << 24) | (t->conf.macaddr.a[2] << 16) | (t->conf.macaddr.a[1] << 8) | (t->conf.macaddr.a[0]);
			break;
		case A_MACA1HR:
			ret = t->MACA1HR;
			break;
		case A_MACA1LR:
			ret = t->MACA1LR;
			break;
		case A_MACA2HR:
			ret = t->MACA2HR;
			break;
		case A_MACA2LR:
			ret = t->MACA2LR;
			break;
		case A_MACA3HR:
			ret = t->MACA3HR;
			break;
		case A_MACA3LR:
			ret = t->MACA3LR;
			break;
		case A_MACRWUFFER:
			ret = t->MACRWUFFER;
			break;
		case A_MMCCR:
			ret = t->MMCCR;
			break;
		case A_MMCRIR:
			ret = t->MMCRIR;
			break;
		case A_MMCTIR:
			ret = t->MMCTIR;
			break;
		case A_MMCRIMR:
			ret = t->MMCRIMR;
			break;
		case A_MMCTIMR:
			ret = t->MMCTIMR;
			break;
		case A_MMCTGFSCCR:
			ret = t->MMCTGFSCCR;
			break;
		case A_MMCTGFMSCCR:
			ret = t->MMCTGFMSCCR;
			break;
		case A_MMCTGFCR:
			ret = t->MMCTGFCR;
			break;
		case A_MMCRFCECR:
			ret = t->MMCRFCECR;
			break;
		case A_MMCRFAECR:
			ret = t->MMCRFAECR;
			break;
		case A_MMCRGUFCR:
			ret = t->MMCRGUFCR;
			break;
		case A_PTPTSCR:
			ret = t->PTPTSCR;
			break;
		case A_PTPSSIR:
			ret = t->PTPSSIR;
			break;
		case A_PTPTSHR:
			ret = t->PTPTSHR;
			break;
		case A_PTPTSLR:
			ret = t->PTPTSLR;
			break;
		case A_PTPTSHUR:
			ret = t->PTPTSHUR;
			break;
		case A_PTPTSLUR:
			ret = t->PTPTSLUR;
			break;
		case A_PTPTSAR:
			ret = t->PTPTSAR;
			break;
		case A_PTPTTHR:
			ret = t->PTPTTHR;
			break;
		case A_PTPTTLR:
			ret = t->PTPTTLR;
			break;
		case A_PTPTSSR:
			ret = t->PTPTSSR;
			break;
		case A_PTPPPSCR:
			ret = t->PTPPPSCR;
			break;
		case A_DMABMR:
			ret = t->DMABMR;
			break;
		case A_DMATPDR:
			ret = t->DMATPDR;
			break;
		case A_DMARPDR:
			ret = t->DMARPDR;
			break;
		case A_DMARDLAR:
			ret = t->DMARDLAR;
			break;
		case A_DMATDLAR:
			ret = t->DMATDLAR;
			break;
		case A_DMASR:
			ret = t->DMASR;
			break;
		case A_DMAOMR:
			ret = t->DMAOMR;
			break;
		case A_DMAIER:
			ret = t->DMAIER;
			break;
		case A_DMAMFBOCR:
			ret = t->DMAMFBOCR;
			break;
		case A_DMARSWTR:
			ret = t->DMARSWTR;
			break;
		case A_DMACHTDR:
			ret = t->DMACHTDR;
			break;
		case A_DMACHRDR:
			ret = t->DMACHRDR;
			break;
		case A_DMACHTBAR:
			ret = t->DMACHTBAR;
			break;
		case A_DMACHRBAR:
			ret = t->DMACHRBAR;
			break;
		default:
			qemu_log_mask(LOG_GUEST_ERROR, "STM32F7 ETH read: bad offset %x\n", (int)offset);
			ret = 0;
			break;
	}
	return ret;
}

static void stm32f7_eth_write(void *opaque, hwaddr offset, uint64_t value, unsigned size) {
	STM32F7ETH *t = STM32F7_ETH(opaque);
	switch (offset) {
		case A_MACCR:
			if (value & R_MACCR_RE_MASK) {
				if (t->DMARDLAR) {
					t->MACCR = value;
				}
			} else if (value & R_MACCR_TE_MASK) {
				if (t->DMATDLAR) {
					t->MACCR = value;
				}
			} else {
				t->MACCR = value;
				t->rxstate = 0;
				t->txstate = 0;
				if (t->timer) {
					timer_free(t->timer);
					t->timer = NULL;
				}
			}
			break;
		case A_MACFFR:
			t->MACFFR = value;
			break;
		case A_MACHTHR:
			t->MACHTHR = value;
			break;
		case A_MACHTLR:
			t->MACHTLR = value;
			break;
		case A_MACMIIAR:
			t->MACMIIAR = (value & (~R_MACMIIAR_MB_MASK));
			break;
		case A_MACMIIDR:
			// t->MACMIIDR = value;
			break;
		case A_MACFCR:
			t->MACFCR = value;
			break;
		case A_MACVLANTR:
			t->MACVLANTR = value;
			break;
		case A_MACPMTCSR:
			t->MACPMTCSR = value;
			break;
		case A_MACSR:
			t->MACSR = value;
			break;
		case A_MACIMR:
			t->MACIMR = value;
			break;
		case A_MACA0HR:
			// t->MACA0HR = value;
			break;
		case A_MACA0LR:
			// t->MACA0LR = value;
			break;
		case A_MACA1HR:
			// t->MACA1HR = value;
			break;
		case A_MACA1LR:
			// t->MACA1LR = value;
			break;
		case A_MACA2HR:
			// t->MACA2HR = value;
			break;
		case A_MACA2LR:
			// t->MACA2LR = value;
			break;
		case A_MACA3HR:
			// t->MACA3HR = value;
			break;
		case A_MACA3LR:
			// t->MACA3LR = value;
			break;
		case A_MACRWUFFER:
			t->MACRWUFFER = value;
			break;
		case A_MMCCR:
			t->MMCCR = value;
			break;
		case A_MMCRIR:
			t->MMCRIR = value;
			break;
		case A_MMCRIMR:
			t->MMCRIMR = value;
			break;
		case A_MMCTIMR:
			t->MMCTIMR = value;
			break;
		case A_PTPTSCR:
			t->PTPTSCR = value;
			break;
		case A_PTPSSIR:
			t->PTPSSIR = value;
			break;
		case A_PTPTSHUR:
			t->PTPTSHUR = value;
			break;
		case A_PTPTSLUR:
			t->PTPTSLUR = value;
			break;
		case A_PTPTSAR:
			t->PTPTSAR = value;
			break;
		case A_PTPTTHR:
			t->PTPTTHR = value;
			break;
		case A_PTPTTLR:
			t->PTPTTLR = value;
			break;
		case A_DMABMR:
            if (value & R_DMABMR_SR_MASK) {
                stm32f7_eth_register_reset(t);
                t->DMABMR &= (~R_DMABMR_SR_MASK);
            } else {
                t->DMABMR = value;
            }
			break;
		case A_DMATPDR:
			// t->DMATPDR = value;
			// dma transmit start
			t->txstate = 1;
			t->DMASR &= (~R_DMASR_TBUS_MASK);
			stm32f7_eth_update(t);
			stm32f7_eth_send(t);
			break;
		case A_DMARPDR:
			t->DMARPDR = value;
			break;
		case A_DMARDLAR:
			if (!(t->MACCR & R_MACCR_RE_MASK)) {
				t->DMARDLAR = value;
				t->cur_rx_descriptor = value;
			}
			break;
		case A_DMATDLAR:
			if (!(t->MACCR & R_MACCR_TE_MASK)) {
				t->DMATDLAR = value;
				t->cur_tx_descriptor = value;
			}
			break;
		case A_DMASR:
			t->DMASR = (value & 0xfffe0000) | ((t->DMASR & (~value)) & 0x00001ffff);
			stm32f7_eth_update(t);
			break;
		case A_DMAOMR:
			t->DMAOMR = value;
			if (value & R_DMAOMR_SR_MASK) {
				t->rxstate = 1;
			} else if (value & R_DMAOMR_ST_MASK) {
				t->txstate = 1;
				if (!(t->timer)) {
					t->timer = timer_new_ns(QEMU_CLOCK_VIRTUAL, stm32f7_eth_timer_callback, t);
				}
				timer_mod(t->timer, qemu_clock_get_ns(QEMU_CLOCK_VIRTUAL) + 10);
			} else {
				t->rxstate = 0;
				t->txstate = 0;
				if (t->timer) {
					timer_free(t->timer);
					t->timer = NULL;
				}
			}
			break;
		case A_DMAIER:
			t->DMAIER = value;
			stm32f7_eth_update(t);
			break;
		case A_DMAMFBOCR:
			t->DMAMFBOCR = value;
			break;
		case A_DMARSWTR:
			t->DMARSWTR = value;
			break;
		default:
			qemu_log_mask(LOG_GUEST_ERROR, "STM32F7 ETH write: bad offset %x\n", (int)offset);
			break;
	}
}

static const MemoryRegionOps stm32f7_eth_ops = {
	.read = stm32f7_eth_read,
	.write = stm32f7_eth_write,
	.endianness = DEVICE_LITTLE_ENDIAN
};

static NetClientInfo net_stm32f7_eth_info = {
    .type = NET_CLIENT_DRIVER_NIC,
    .size = sizeof(NICState),
    .can_receive = stm32f7_eth_can_receive,
    .receive = stm32f7_eth_receive,
};

