VoodooChild99/qemu-stm32f769/hw/net/stm32f7-eth.c
static void stm32f7_eth_init(Object *obj) {
	return;
}

static void stm32f7_eth_timer_callback(void *opaque) {
	STM32F7ETH *eth = (STM32F7ETH*)opaque;
	ETH_DMADescTypeDef tx_desc;
	if (eth->cur_tx_descriptor && eth->txstate) {
		cpu_physical_memory_read(eth->cur_tx_descriptor, &tx_desc, sizeof(tx_desc));
		if (!(tx_desc.Status & 0x80000000)) {
			eth->DMASR |= R_DMASR_TBUS_MASK;
			eth->txstate = 0;
			stm32f7_eth_update(eth);
			// wait for poll command, dont update timer
			return;
		} else {
			// owned, try to send this
			stm32f7_eth_send(eth);
			// as long as no error happended, the timer is restarted
		}
	}
}

static void stm32f7_eth_realize(DeviceState *dev, Error **errp) {
    SysBusDevice *sbd = SYS_BUS_DEVICE(dev);
	STM32F7ETH *t = STM32F7_ETH(dev);

	memory_region_init_io(
        &(t->iomem), OBJECT(t), &stm32f7_eth_ops, t,
        "stm32f7-eth", STM32F7_ETH_SIZE
    );
	sysbus_init_mmio(sbd, &(t->iomem));
	for (int i = 0 ; i < 2 ; ++i) {
		sysbus_init_irq(sbd, &(t->irq[i]));
	}

    qemu_macaddr_default_if_unset(&t->conf.macaddr);
    t->nic = qemu_new_nic(
        &net_stm32f7_eth_info, &t->conf,
        object_get_typename(OBJECT(dev)), dev->id, t
    );
    qemu_format_nic_info_str(qemu_get_queue(t->nic), t->conf.macaddr.a);
	// create a timer
	t->timer = timer_new_ns(QEMU_CLOCK_VIRTUAL, stm32f7_eth_timer_callback, t);
}

static void stm32f7_eth_reset_enter(Object *obj, ResetType type) {
	STM32F7ETH *t = STM32F7_ETH(obj);

	stm32f7_eth_register_reset(t);
}

static const VMStateDescription stm32f7_eth_vmstate = {
	.name = "stm32f7-eth",
	.version_id = 0,
	.minimum_version_id = 0,
	.fields = (VMStateField[]) {
		VMSTATE_UINT32(MACCR, STM32F7ETH),
		VMSTATE_UINT32(MACFFR, STM32F7ETH),
		VMSTATE_UINT32(MACHTHR, STM32F7ETH),
		VMSTATE_UINT32(MACHTLR, STM32F7ETH),
		VMSTATE_UINT32(MACMIIAR, STM32F7ETH),
		VMSTATE_UINT32(MACMIIDR, STM32F7ETH),
		VMSTATE_UINT32(MACFCR, STM32F7ETH),
		VMSTATE_UINT32(MACVLANTR, STM32F7ETH),
		VMSTATE_UINT32(MACPMTCSR, STM32F7ETH),
		VMSTATE_UINT32(MACDBGR, STM32F7ETH),
		VMSTATE_UINT32(MACSR, STM32F7ETH),
		VMSTATE_UINT32(MACIMR, STM32F7ETH),
		VMSTATE_UINT32(MACA0HR, STM32F7ETH),
		VMSTATE_UINT32(MACA0LR, STM32F7ETH),
		VMSTATE_UINT32(MACA1HR, STM32F7ETH),
		VMSTATE_UINT32(MACA1LR, STM32F7ETH),
		VMSTATE_UINT32(MACA2HR, STM32F7ETH),
		VMSTATE_UINT32(MACA2LR, STM32F7ETH),
		VMSTATE_UINT32(MACA3HR, STM32F7ETH),
		VMSTATE_UINT32(MACA3LR, STM32F7ETH),
		VMSTATE_UINT32(MACRWUFFER, STM32F7ETH),
		VMSTATE_UINT32(MMCCR, STM32F7ETH),
		VMSTATE_UINT32(MMCRIR, STM32F7ETH),
		VMSTATE_UINT32(MMCTIR, STM32F7ETH),
		VMSTATE_UINT32(MMCRIMR, STM32F7ETH),
		VMSTATE_UINT32(MMCTIMR, STM32F7ETH),
		VMSTATE_UINT32(MMCTGFSCCR, STM32F7ETH),
		VMSTATE_UINT32(MMCTGFMSCCR, STM32F7ETH),
		VMSTATE_UINT32(MMCTGFCR, STM32F7ETH),
		VMSTATE_UINT32(MMCRFCECR, STM32F7ETH),
		VMSTATE_UINT32(MMCRFAECR, STM32F7ETH),
		VMSTATE_UINT32(MMCRGUFCR, STM32F7ETH),
		VMSTATE_UINT32(PTPTSCR, STM32F7ETH),
		VMSTATE_UINT32(PTPSSIR, STM32F7ETH),
		VMSTATE_UINT32(PTPTSHR, STM32F7ETH),
		VMSTATE_UINT32(PTPTSLR, STM32F7ETH),
		VMSTATE_UINT32(PTPTSHUR, STM32F7ETH),
		VMSTATE_UINT32(PTPTSLUR, STM32F7ETH),
		VMSTATE_UINT32(PTPTSAR, STM32F7ETH),
		VMSTATE_UINT32(PTPTTHR, STM32F7ETH),
		VMSTATE_UINT32(PTPTTLR, STM32F7ETH),
		VMSTATE_UINT32(PTPTSSR, STM32F7ETH),
		VMSTATE_UINT32(PTPPPSCR, STM32F7ETH),
		VMSTATE_UINT32(DMABMR, STM32F7ETH),
		VMSTATE_UINT32(DMATPDR, STM32F7ETH),
		VMSTATE_UINT32(DMARPDR, STM32F7ETH),
		VMSTATE_UINT32(DMARDLAR, STM32F7ETH),
		VMSTATE_UINT32(DMATDLAR, STM32F7ETH),
		VMSTATE_UINT32(DMASR, STM32F7ETH),
		VMSTATE_UINT32(DMAOMR, STM32F7ETH),
		VMSTATE_UINT32(DMAIER, STM32F7ETH),
		VMSTATE_UINT32(DMAMFBOCR, STM32F7ETH),
		VMSTATE_UINT32(DMARSWTR, STM32F7ETH),
		VMSTATE_UINT32(DMACHTDR, STM32F7ETH),
		VMSTATE_UINT32(DMACHRDR, STM32F7ETH),
		VMSTATE_UINT32(DMACHTBAR, STM32F7ETH),
		VMSTATE_UINT32(DMACHRBAR, STM32F7ETH),
		VMSTATE_END_OF_LIST()
	}
};

static Property stm32f7_eth_properties[] = {
    DEFINE_NIC_PROPERTIES(STM32F7ETH, conf),
    DEFINE_PROP_END_OF_LIST(),
};

static void stm32f7_eth_class_init(ObjectClass *oc, void *data) {
	DeviceClass *dc = DEVICE_CLASS(oc);
	ResettableClass *rc = RESETTABLE_CLASS(oc);

	dc->vmsd = &stm32f7_eth_vmstate;
	dc->realize = stm32f7_eth_realize;
	rc->phases.enter = stm32f7_eth_reset_enter;

    device_class_set_props(dc, stm32f7_eth_properties);
}

static const TypeInfo stm32f7_eth_info = {
	.name = TYPE_STM32F7_ETH,
	.parent = TYPE_SYS_BUS_DEVICE,
	.instance_size = sizeof(STM32F7ETH),
	.instance_init = stm32f7_eth_init,
	.class_init = stm32f7_eth_class_init
};

static void stm32f7_eth_register_types(void) {
	type_register_static(&stm32f7_eth_info);
}

type_init(stm32f7_eth_register_types);